bench/results/20260917T195041Z-cursor/raw/heavy/api/slang/round1/point-c512.wrk.txt
Running 10s test @ http://127.0.0.1:18401
  1 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.62ms  309.20ms   3.71s    93.96%
    Req/Sec    11.75k   771.04    14.05k    73.00%
  Latency Distribution
     50%   40.98ms
     75%  120.91ms
     90%  282.59ms
     99%    1.67s 
  116905 requests in 10.05s, 23.34MB read
Requests/sec:  11627.59
Transfer/sec:      2.32MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0